In [1]:
import pandas as pd
import numpy as py

file_to_load = "Resources/census_data.csv"
census_data = pd.read_csv(file_to_load)

In [2]:
#Importing SqlAlchemy to use import DataFrame into Postgress.
import sqlalchemy
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

#Get connection credentials from config file
from config import username, password
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/TargetCensusDB')
# engine = create_engine(f'postgresql+psycopg2://{username}:{password}@localhost:5432/census_data')
connection = engine.connect()

In [19]:
# Read title table into dataframe
StoreCount_Select = "SELECT state, county, state_abbr, store_count from target_count_county"
targetCount_byCounty = pd.read_sql(StoreCount_Select, connection)
targetCount_byCounty

         state     county state_abbr  store_count
0      Alabama    Autauga         AL            1
1      Alabama    Baldwin         AL            2
2      Alabama    Calhoun         AL            1
3      Alabama    Houston         AL            1
4      Alabama  Jefferson         AL            6
..         ...        ...        ...          ...
610  Wisconsin   Waukesha         WI            6
611  Wisconsin  Winnebago         WI            1
612  Wisconsin       Wood         WI            1
613    Wyoming    Laramie         WY            1
614    Wyoming    Natrona         WY            1

[615 rows x 4 columns]

In [20]:
county_data = census_data.loc[:, ["State", "County", "Income", "TotalPop", "Men", "Women", "Hispanic", "White", "Black", "Native", "Asian", "Pacific", "MeanCommute", "Employed"]]
census_county = census_data["County"].value_counts()
county_income = county_data.groupby(["County", "State"]).mean()["Income"].rename("Mean Income Per County")
county_commute = county_data.groupby(["County", "State"]).mean()["MeanCommute"].rename("MeanCommute")
county_employed = county_data.groupby(["County", "State"]).sum()["Employed"].rename("Employed")
county_analysis = pd.DataFrame({"Mean Income By County":county_income.map("${:,.2f}".format),                                  
                                "Mean Commute":county_commute.round(), "Employed":county_employed.round()})


county_analysis

                         Mean Income By County  Mean Commute  Employed
County    State
Abbeville South Carolina            $35,159.83          29.0      9294
Acadia    Louisiana                 $39,619.33          27.0     24619
Accomack  Virginia                  $39,467.00          20.0     14296
Ada       Idaho                     $59,137.41          19.0    199955
Adair     Iowa                      $46,859.67          22.0      3776
...                                        ...           ...       ...
Yuma      Arizona                   $41,836.85          19.0     71622
          Colorado                  $43,675.50          16.0      4878
Zapata    Texas                     $32,770.33          20.0      5184
Zavala    Texas                     $23,471.50          17.0      4276
Ziebach   South Dakota              $35,119.00          20.0       948

[3220 rows x 3 columns]

In [21]:
county_analysis_reset = county_analysis.reset_index()
county_analysis_reset.columns = [t.lower() for t in county_analysis_reset.columns]
county_analysis_reset

         county           state mean income by county  mean commute  employed
0     Abbeville  South Carolina            $35,159.83          29.0      9294
1        Acadia       Louisiana            $39,619.33          27.0     24619
2      Accomack        Virginia            $39,467.00          20.0     14296
3           Ada           Idaho            $59,137.41          19.0    199955
4         Adair            Iowa            $46,859.67          22.0      3776
...         ...             ...                   ...           ...       ...
3215       Yuma         Arizona            $41,836.85          19.0     71622
3216       Yuma        Colorado            $43,675.50          16.0      4878
3217     Zapata           Texas            $32,770.33          20.0      5184
3218     Zavala           Texas            $23,471.50          17.0      4276
3219    Ziebach    South Dakota            $35,119.00          20.0       948

[3220 rows x 5 columns]

In [24]:
target_census = pd.merge(targetCount_byCounty, county_analysis_reset, how='left', on=['county', 'state'])
target_census

,state,county,state_abbr,store_count,mean income by county,mean commute,employed
0,Alabama,Autauga,AL,1,"$49,985.00",26.0,23986.0
1,Alabama,Baldwin,AL,2,"$48,672.84",26.0,85953.0
2,Alabama,Calhoun,AL,1,"$38,152.89",23.0,47401.0
3,Alabama,Houston,AL,1,"$39,571.55",21.0,44067.0
4,Alabama,Jefferson,AL,6,"$46,625.43",23.0,293202.0
...,...,...,...,...,...,...,...
610,Wisconsin,Waukesha,WI,6,"$78,845.40",24.0,209461.0
611,Wisconsin,Winnebago,WI,1,"$51,661.54",19.0,85970.0
612,Wisconsin,Wood,WI,1,"$48,998.35",19.0,36445.0
613,Wyoming,Laramie,WY,1,"$62,548.05",15.0,46206.0
614,Wyoming,Natrona,WY,1,"$59,266.72",17.0,41415.0

In [25]:
#Export to Postgres
engine.execute("delete FROM target_income_stats")
target_census.to_sql('target_income_stats', engine, if_exists='append', index=False)